# PanelType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Panel..::..PanelType Property
Panel Class See Also
---
The Panel style of this Panel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PanelType PanelType { get; set; }
```

Visual Basic
---
```text
Public Property PanelType As PanelType
	Get
	Set
```

Visual C++
---
```text
public:
property PanelType^ PanelType {
	PanelType^ get ();
	void set (PanelType^ value);
}
```

# Remarks
The Symbol property can be used to retrieve the kind of the panel. This property can also be used to change the type of a panel by setting it to a different type. All the panel types in the project can be found using the Document.CurtainPanelTypes property.
# See Also
Panel Class
Autodesk.Revit.DB Namespace